# NormalizInterface, chapter 2
#
# DO NOT EDIT THIS FILE - EDIT EXAMPLES IN THE SOURCE INSTEAD!
#
# This file has been generated by AutoDoc. It contains examples extracted from
# the package documentation. Each example is preceded by a comment which gives
# the name of a GAPDoc XML file and a line range from which the example were
# taken. Note that the XML file in turn may have been generated by AutoDoc
# from some other input.
#
gap> START_TEST( "normalizinterface01.tst");

# doc/_Chunks.xml:164-167
gap> cone := NmzCone(["integral_closure",[[2,1],[1,3]]]);
<a Normaliz cone>

# doc/_Chunks.xml:120-123
gap> NmzHasConeProperty(cone, "ExtremeRays");
false

# doc/_Chunks.xml:129-133
gap> NmzKnownConeProperties(cone);
[ "Generators", "OriginalMonoidGenerators", "InternalIndex", "EmbeddingDim", 
  "IsInhomogeneous", "Sublattice" ]

# doc/_Chunks.xml:139-158
gap> NmzKnownConeProperties(cone);
[ "Generators", "OriginalMonoidGenerators", "InternalIndex", "EmbeddingDim", 
  "IsInhomogeneous", "Sublattice" ]
gap> NmzCompute(cone, ["SupportHyperplanes", "IsPointed"]);
true
gap> NmzKnownConeProperties(cone);
[ "Generators", "ExtremeRays", "SupportHyperplanes", 
  "OriginalMonoidGenerators", "MaximalSubspace", "InternalIndex", "Rank", 
  "EmbeddingDim", "IsPointed", "IsDeg1ExtremeRays", "IsInhomogeneous", 
  "Sublattice" ]
gap> NmzCompute(cone);;
gap> NmzKnownConeProperties(cone);
[ "Generators", "ExtremeRays", "SupportHyperplanes", "HilbertBasis", 
  "OriginalMonoidGenerators", "MaximalSubspace", "ClassGroup", 
  "TriangulationDetSum", "UnitGroupIndex", "InternalIndex", 
  "TriangulationSize", "Rank", "EmbeddingDim", "IsPointed", 
  "IsDeg1ExtremeRays", "IsIntegrallyClosed", "IsInhomogeneous", "Sublattice", 
  "IsTriangulationNested", "IsTriangulationPartial" ]

#
gap> STOP_TEST("normalizinterface01.tst", 1 );
